Revit 2026 API

# RebarCurvesDataSetDistributionPath Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDistributionPath(
	IList<Curve> path
)
```
```vb
Public Sub SetDistributionPath (
	path As IList(Of Curve)
)
```
```cpp
public:
void SetDistributionPath(
	IList<Curve^>^ path
)
```
```fsharp
member SetDistributionPath :
        path : IList<Curve> -> unit
```

#### Parameters

path IListCurve

#### Reference

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace